Core/src/DataProcessors/Ценообразование/Ценообразование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Ценообразование</name>
</mdclass:DataProcessor>

Core/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>Справочник_ХарактеристикиНоменклатуры</name>
      <description>Характеристики номенклатуры</description>
    </items>
    <items>
      <name>Документ_АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Документ_АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Справочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Документ_ДоговорКредитаИЗайма</name>
      <description>Договор кредита и займа</description>
    </items>
    <items>
      <name>Справочник_ДоговорыКонтрагентов</name>
      <description>Договоры контрагентов</description>
    </items>
    <items>
      <name>Документ_ПриемИПередачаВРемонт</name>
      <description>Документ прием и передача в ремонт</description>
    </items>
    <items>
      <name>Документ_СборкаЗапасов</name>
      <description>Документ сборка запасов</description>
    </items>
    <items>
      <name>Документ_ЗаданиеНаРаботу</name>
      <description>Задание на работу</description>
    </items>
    <items>
      <name>Документ_ЗаказНаПроизводство</name>
      <description>Заказ на производство</description>
    </items>
    <items>
      <name>Документ_ЗаказПокупателя</name>
      <description>Заказ покупателя</description>
    </items>
    <items>
      <name>Документ_ЗаказПоставщику</name>
      <description>Заказ поставщику</description>
    </items>
    <items>
      <name>Документ_РасходДСПлан</name>
      <description>Заявка на расход денег</description>
    </items>
    <items>
      <name>Справочник_ВнеоборотныеАктивы</name>
      <description>Имущество</description>
    </items>
    <items>
      <name>Справочник_КонтактныеЛица</name>
      <description>Контактные лица</description>
    </items>
    <items>
      <name>Справочник_Контрагенты</name>
      <description>Контрагенты</description>
    </items>
    <items>
      <name>Документ_КорректировкаПоступления</name>
      <description>Корректировка поступления</description>
    </items>
    <items>
      <name>Документ_КорректировкаРеализации</name>
      <description>Корректировка реализации</description>
    </items>
    <items>
      <name>Документ_НачисленияПоКредитамИЗаймам</name>
      <description>Начисления по кредитам и займам</description>
    </items>
    <items>
      <name>Справочник_НоменклатураПоставщиков</name>
      <description>Номенклатура поставщиков</description>
    </items>
    <items>
      <name>Документ_ОперацияПоПлатежнымКартам</name>
      <description>Операция по платежным картам</description>
    </items>
    <items>
      <name>Документ_ОприходованиеЗапасов</name>
      <description>Оприходование запасов</description>
    </items>
    <items>
      <name>Справочник_Организации</name>
      <description>Организации</description>
    </items>
    <items>
      <name>Документ_ОтчетОРозничныхПродажах</name>
      <description>Отчет о розничных продажах</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Папки файлов</description>
    </items>
    <items>
      <name>Справочник_ПартииНоменклатуры</name>
      <description>Партии номенклатуры</description>
    </items>
    <items>
      <name>Документ_ПеремещениеДС</name>
      <description>Перемещение денег</description>
    </items>
    <items>
      <name>Документ_ПеремещениеЗапасов</name>
      <description>Перемещение запасов</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Документ_ПоступлениеВКассу</name>
      <description>Поступление в кассу</description>
    </items>
    <items>
      <name>Документ_ПоступлениеНаСчет</name>
      <description>Поступление на счет</description>
    </items>
    <items>
      <name>Документ_ПриходнаяНакладная</name>
      <description>Приходная накладная</description>
    </items>
    <items>
      <name>Документ_ПриходныйОрдер</name>
      <description>Приходный ордер</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>Документ_РасходИзКассы</name>
      <description>Расход из кассы</description>
    </items>
    <items>
      <name>Документ_РасходСоСчета</name>
      <description>Расход со счета</description>
    </items>
    <items>
      <name>Документ_РасходнаяНакладная</name>
      <description>Расходная накладная</description>
    </items>
    <items>
      <name>Документ_РасходныйОрдер</name>
      <description>Расходный ордер</description>
    </items>
    <items>
      <name>Справочник_СерийныеНомера</name>
      <description>Серийные номера</description>
    </items>
    <items>
      <name>Документ_Событие</name>
      <description>Событие</description>
    </items>
    <items>
      <name>Документ_СписаниеЗапасов</name>
      <description>Списание запасов</description>
    </items>
    <items>
      <name>Справочник_СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
    </items>
    <items>
      <name>Справочник_СтруктурныеЕдиницы</name>
      <description>Структурные единицы</description>
    </items>
    <items>
      <name>Документ_СчетНаОплату</name>
      <description>Счет на оплату</description>
    </items>
    <items>
      <name>Документ_СчетНаОплатуПоставщика</name>
      <description>Счет на оплату поставщика</description>
    </items>
    <items>
      <name>Справочник_ТранспортныеСредства</name>
      <description>Транспортные средства</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файлы</description>
    </items>
    <items>
      <name>Справочник_ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВдокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/Ценообразование/Forms/ФормаЗаполненияПоДопРеквизитамХарактеристики/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеСкидкиНаценки") Тогда
		Элементы.ЗначениеСкидкиНаценки.Видимость = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
		|ГДЕ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры)
		|	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.Используется
		|ИТОГИ ПО
		|	Заголовок";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаголовок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаголовок.Следующий() Цикл
		НовСтрока = ДополнительныеРеквизиты.Добавить();
		НовСтрока.Свойство = ВыборкаЗаголовок.Заголовок;
		СписокСвоиств = Новый Массив;
		ВыборкаДЗ = ВыборкаЗаголовок.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			СписокСвоиств.Добавить(ВыборкаДЗ.Свойство);
		КонецЦикла;
		НовСтрока.СписокСвоиств.ЗагрузитьЗначения(СписокСвоиств);
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Если ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо отметить хотябы одиного свойства'; ka = 'აუცილებელია ერთი თვისების არჩევა მაინც!'; en = 'აუცილებელია ერთი თვისების არჩევა მაინც!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ЦеновыеГруппы");
	Иначе
		АдресВременногоХранилища = ЗаписатьВХранилищеДанныеТабличнойЧасти();
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, АдресВременногоХранилища));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилищеДанныеТабличнойЧасти()
	
	//ТаблицаНоменклатуры
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("КлючСвязи", 				Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмеренияШаблон", 	Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения, СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЦенаНоваяШаблон", 		Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", 			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//ТаблицаХарактеристик
	ТаблицаХарактеристик = Новый ТаблицаЗначений;
	ТаблицаХарактеристик.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаХарактеристик.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаХарактеристик.Колонки.Добавить("КлючСвязи", 				Новый ОписаниеТипов("Число"));
	ТаблицаХарактеристик.Колонки.Добавить("ЕдиницаИзмеренияШаблон", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения, СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаХарактеристик.Колонки.Добавить("ЦенаНоваяШаблон", 		Новый ОписаниеТипов("Число"));
	ТаблицаХарактеристик.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаХарактеристик.Колонки.Добавить("ХарактеристикиИспользуются",	Новый ОписаниеТипов("Булево"));
	ТаблицаХарактеристик.Колонки.Добавить("ЭтоГруппа", 					Новый ОписаниеТипов("Булево"));
	ТаблицаХарактеристик.Колонки.Добавить("ЗначениеСкидкиНаценки",		Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначениеСкидкиНаценки", ЗначениеСкидкиНаценки);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ИспользоватьХарактеристики КАК ХарактеристикиИспользуются,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ЭтоГруппа КАК ЭтоГруппа,
		|	&ЗначениеСкидкиНаценки,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец ССЫЛКА Справочник.Номенклатура
		|	И &УсловиеЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ЕдиницаИзмерения)
		|ПО
		|	Номенклатура";
	УсловиеЗапроса = "";
	Итератор	   = 0;
	Для Каждого СтрокаТЧ ИЗ ДополнительныеРеквизиты Цикл
		Если СтрокаТЧ.Пометка Тогда
			Итератор 		= Итератор + 1;
			ИтераторСтрокой = Формат(Итератор, "ЧРГ=; ЧГ=0");
			УсловиеСтроки  = " И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство В(&Свойство"+ИтераторСтрокой+") И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение В(&Значение"+ИтераторСтрокой+") ";
			УсловиеЗапроса = УсловиеЗапроса + УсловиеСтроки;
			Запрос.УстановитьПараметр("Свойство" + ИтераторСтрокой, СтрокаТЧ.СписокСвоиств);
			Запрос.УстановитьПараметр("Значение" + ИтераторСтрокой, СтрокаТЧ.Список_Значении);
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеЗапроса", УсловиеЗапроса);
	ЛокальныйКлючСвязи = 1;
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		НоваяСтрокаНоменклатура = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНоменклатура, ВыборкаНоменклатура);
		НоваяСтрокаНоменклатура.КлючСвязи = ЛокальныйКлючСвязи;
		ВыборкаДЗ = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			НоваяСтрокаХарактеристика = ТаблицаХарактеристик.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаХарактеристика, ВыборкаДЗ);
			НоваяСтрокаХарактеристика.КлючСвязи = ЛокальныйКлючСвязи;
		КонецЦикла;
		ЛокальныйКлючСвязи = ЛокальныйКлючСвязи + 1;
	КонецЦикла;

	СтруктураРезультата = Новый Структура("ТаблицаНоменклатуры, ТаблицаХарактеристик", ТаблицаНоменклатуры, ТаблицаХарактеристик);
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультата);

КонецФункции

&НаКлиенте
Процедура ДополнительныеРеквизитыСписок_ЗначенииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначенияВКолонтуСписокЗначенииТекСтроки(Команда)
	
	ТекущиеДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыВыбора.Вставить("Заголовок", 		   Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Свойство);
	РезультатВыбора = ОткрытьФормуМодально("Обработка.Ценообразование.Форма.ФормаВыбораХарактеристик", ПараметрыВыбора);//Обработка.Ценообразование.Форма.ЗначенияДопРеквизитов

	Если НЕ РезультатВыбора = Неопределено Тогда
		//ТекущиеДанные.Список_Значении.ЗагрузитьЗначения(РезультатВыбора);
		Для Каждого ЗнСписка Из РезультатВыбора Цикл
			ТекущиеДанные.Список_Значении.Добавить(ЗнСписка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
